---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.AutoJoinFailedException
source: html/39a51d0a-b8ca-2dfc-8a30-3c7ca4671be7.htm
---
# AutoJoinFailedException Members

Retrieves data needed to serialize the target object.